static/html/articles/Git-Cookie.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2016-11-10 Thu 13:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Git Cookie</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Junjia Ni">
<meta name="description" content="Git Cookie"
>
<meta name="keywords" content="git">
<link rel="stylesheet" type="text/css" href="/static/article.css"><!--[if lt IE 9]>
<![endif]-->
</head>
<body>
<div id="content">
<header>
<h1 class="title">Git Cookie</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ceffd9">1. 前言</a></li>
<li><a href="#org15f6181">2. Rewrite History</a></li>
<li><a href="#org2aa584d">3. Delete git submodles</a></li>
<li><a href="#orgefdc671">4. Update Index</a></li>
</ul>
</div>
</nav>


<div id="outline-container-org0ceffd9" class="outline-2">
<h2 id="org0ceffd9"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
一些关于 <b>git</b> 的小知识。用于git问题收集。
</p>
</div>
</div>

<div id="outline-container-org15f6181" class="outline-2">
<h2 id="org15f6181"><span class="section-number-2">2</span> Rewrite History</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">git filter-branch --commit-filter <span style="color: #8abeb7;">'</span>
<span style="color: #8abeb7;">       if [ "$GIT_AUTHOR_EMAIL" = "schacon@localhost" ];</span>
<span style="color: #8abeb7;">       then</span>
<span style="color: #8abeb7;">               GIT_AUTHOR_NAME="Scott Chacon";</span>
<span style="color: #8abeb7;">               GIT_AUTHOR_EMAIL="schacon@example.com";</span>
<span style="color: #8abeb7;">               git commit-tree "$@";</span>
<span style="color: #8abeb7;">       else</span>
<span style="color: #8abeb7;">               git commit-tree "$@";</span>
<span style="color: #8abeb7;">       fi'</span> HEAD
</pre>
</div>
</div>
</div>

<div id="outline-container-org2aa584d" class="outline-2">
<h2 id="org2aa584d"><span class="section-number-2">3</span> Delete git submodles</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://yuguo.us/weblog/git-submodule/">http://yuguo.us/weblog/git-submodule/</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git rm --cached <span style="color: #c5c8c6;">[</span>path<span style="color: #c5c8c6;">]</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#32534;&#36753;.gitmodules&#25991;&#20214;&#65292;&#23558;&#23376;&#27169;&#22359;&#30340;&#30456;&#20851;&#37197;&#32622;&#33410;&#28857;&#21024;&#38500;&#25481;</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#32534;&#36753;.git/config&#25991;&#20214;&#65292;&#23558;&#23376;&#27169;&#22359;&#30340;&#30456;&#20851;&#37197;&#32622;&#33410;&#28857;&#21024;&#38500;&#25481;[&#36825;&#19968;&#27493;&#22909;&#20687;&#24456;&#19981;&#31185;&#23398;&#65292;&#20026;&#20160;&#20040;&#20449;&#24687;&#35201;&#20445;&#23384;&#20004;&#20221;&#65311;]</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#25163;&#21160;&#21024;&#38500;&#23376;&#27169;&#22359;&#27531;&#30041;&#30340;&#30446;&#24405;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefdc671" class="outline-2">
<h2 id="orgefdc671"><span class="section-number-2">4</span> Update Index</h2>
<div class="outline-text-2" id="text-4">
<p>
这个命令可以让git不跟踪指定文件，但同时可以继续保存在项目中。有点类似于 <code>.gitignore</code> 的作用。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git update-index --assume-unchanged FILE_NAME
$ git update-index --no-assume-unchanged FILE_NAME
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">Junjia Ni</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2016-11-10 Thu 13:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0)</p>
<p class="validation"></p>
<p class="last-modification-time">2016-10-23 Sun 23:09</p></div><script src="/static/article.js"></script><!-- Google Analytics --><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><!-- End Google Analytics -->
</div>
</body>
</html>
